{
  "pt": "<div><h2>Visão Geral do Projeto</h2><p>O avanço dos modelos generativos multimodais tem sido notável, mas a diversidade linguística e cultural ainda é um desafio, especialmente para o português. A maioria dos benchmarks usados para avaliar esses modelos é predominantemente em inglês, comprometendo a captura das nuances e particularidades da língua portuguesa.</p><h3>Nossa Abordagem</h3><p>Para enfrentar essa limitação, desenvolvemos o BEMU (Benchmarks Educacionais Multimodais Universitárias), focado na criação de um conjunto de dados multimodal baseado em questões de vestibulares brasileiros (Unesp, Unicamp, USP, ENEM, FAMERP e Santa Casa). Coletamos mais de 5 mil questões cobrindo diversas áreas do conhecimento, preservando o contexto cultural e linguístico original, sem depender de traduções.</p><h3>Componentes do Projeto</h3><ul><li>Coleta de questões de vestibulares brasileiros</li><li>Parsing de PDFs e extração estruturada de conteúdo</li><li>Preservação de textos autênticos (como trechos literários e jornalísticos)</li><li>Inclusão de imagens representativas da cultura brasileira</li></ul><h3>Resultados e Impacto</h3><p>Nosso objetivo é fornecer um benchmark mais preciso e culturalmente relevante para a avaliação de modelos multimodais em português. Esse esforço contribui para o avanço da pesquisa em IA no Brasil e estabelece um precedente para a inclusão de outras línguas não-inglesas na avaliação de modelos de IA.</p><p>O projeto foi realizado como uma colaboração entre várias instituições coordenada pela <a href=\"https://cohere.com/research\" target=\"_blank\">Cohere Labs</a>. Mais detalhes sobre o projeto e sobre o <a href=\"https://huggingface.co/datasets/CohereLabs/kaleidoscope\" target=\"_blank\">dataset</a> multilíngue e multimodal resultante pode ser encontrado em <a href=\"https://arxiv.org/pdf/2504.07072\" target=\"_blank\">Kaleidoscope: In-language Exams for Massively Multilingual Vision Evaluation</a>.</p></div>",
  "en": "<div><h2>Project Overview</h2><p>The advancement of generative multimodal models has been remarkable, but linguistic and cultural diversity remains a challenge, especially for Portuguese. Most benchmarks used to evaluate these models are predominantly in English, compromising the capture of nuances and particularities of the Portuguese language.</p><h3>Our Approach</h3><p>To address this limitation, we developed BEMU (Educational Multimodal University Benchmarks), focused on creating a multimodal dataset based on Brazilian university entrance exams (Unesp, Unicamp, USP, ENEM, FAMERP, and Santa Casa). We collected over 5,000 questions covering various knowledge areas, preserving the original cultural and linguistic context, without relying on translations.</p><h3>Project Components</h3><ul><li>Collection of questions from Brazilian university entrance exams</li><li>PDF parsing and structured content extraction</li><li>Preservation of authentic texts (such as literary and journalistic excerpts)</li><li>Inclusion of images representative of Brazilian culture</li></ul><h3>Results and Impact</h3><p>Our goal is to provide a more accurate and culturally relevant benchmark for evaluating multimodal models in Portuguese. This effort contributes to the advancement of AI research in Brazil and establishes a precedent for including other non-English languages in AI model evaluation.</p><p>The project was carried out as a collaboration between several institutions coordinated by <a href=\"https://cohere.com/research\" target=\"_blank\">Cohere Labs</a>. More details about the project and the resulting multilingual and multimodal <a href=\"https://huggingface.co/datasets/CohereLabs/kaleidoscope\" target=\"_blank\">dataset</a> can be found in <a href=\"https://arxiv.org/pdf/2504.07072\" target=\"_blank\">Kaleidoscope: In-language Exams for Massively Multilingual Vision Evaluation</a>.</p></div>",
  "es": "<div><h2>Visión General del Proyecto</h2><p>El avance de los modelos generativos multimodales ha sido notable, pero la diversidad lingüística y cultural sigue siendo un desafío, especialmente para el portugués. La mayoría de los benchmarks utilizados para evaluar estos modelos son predominantemente en inglés, comprometiendo la captura de matices y particularidades de la lengua portuguesa.</p><h3>Nuestro Enfoque</h3><p>Para enfrentar esta limitación, desarrollamos BEMU (Benchmarks Educativos Multimodales Universitarios), enfocado en la creación de un conjunto de datos multimodal basado en exámenes de ingreso universitario brasileños (Unesp, Unicamp, USP, ENEM, FAMERP y Santa Casa). Recopilamos más de 5.000 preguntas que cubren diversas áreas de conocimiento, preservando el contexto cultural y lingüístico original, sin depender de traducciones.</p><h3>Componentes del Proyecto</h3><ul><li>Recopilación de preguntas de exámenes de ingreso universitario brasileños</li><li>Análisis de PDFs y extracción estructurada de contenido</li><li>Preservación de textos auténticos (como extractos literarios y periodísticos)</li><li>Inclusión de imágenes representativas de la cultura brasileña</li></ul><h3>Resultados e Impacto</h3><p>Nuestro objetivo es proporcionar un benchmark más preciso y culturalmente relevante para la evaluación de modelos multimodales en portugués. Este esfuerzo contribuye al avance de la investigación en IA en Brasil y establece un precedente para la inclusión de otros idiomas no ingleses en la evaluación de modelos de IA.</p><p>El proyecto fue realizado como una colaboración entre varias instituciones coordinada por <a href=\"https://cohere.com/research\" target=\"_blank\">Cohere Labs</a>. Más detalles sobre el proyecto y el <a href=\"https://huggingface.co/datasets/CohereLabs/kaleidoscope\" target=\"_blank\">dataset</a> multilingüe y multimodal resultante se pueden encontrar en <a href=\"https://arxiv.org/pdf/2504.07072\" target=\"_blank\">Kaleidoscope: In-language Exams for Massively Multilingual Vision Evaluation</a>.</p></div>"
}
