{
    "pt": "<div><h2>Visão Geral do Projeto</h2><p>O BoneCheck é um sistema de inteligência artificial voltado para a detecção precoce de osteoporose por meio da análise automática de radiografias panorâmicas. Utilizando redes neurais e técnicas de classificação de imagens, o projeto busca oferecer uma solução acessível e não invasiva para auxiliar profissionais da saúde na triagem de pacientes com risco da doença. O projeto foi desenvolvido em parceria com a Faculdade de Odontologia da USP Ribeirão Preto.</p><h3>Principais Características</h3><ul><li>Classificação de radiografias panorâmicas em osteoporose, osteopenia ou normal</li><li>Uso de ensemble de modelos para maior precisão</li><li>Aplicação exploratória de VLMs para imagens médicas</li></ul><h3>Tecnologias Utilizadas</h3><p>O projeto foi desenvolvido utilizando:</p><ul><li>Redes convolucionais (ConvNeXT, EfficientNet, DeiT, Swin)</li><li>XGBoost para ensemble</li><li>Gemini 2.5 Pro e GPT-4o para experimentos com LLMs</li></ul><h3>Resultados</h3><p>O modelo Ensemble foi o mais eficaz na classificação entre as três categorias. ConvNeXT e DeiT também mostraram bom desempenho. Swin teve resultado intermediário e EfficientNet apresentou desequilíbrio entre classes. Modelos de linguagem tiveram desempenho inferior aos modelos visuais.</p></div>",
    "en": "<div><h2>Project Overview</h2><p>BoneCheck is an AI system designed for the early detection of osteoporosis through automatic analysis of panoramic radiographs. Using neural networks and image classification techniques, it offers a fast, accessible, and non-invasive alternative to traditional bone density exams. The project was developed in collaboration with the School of Dentistry at USP Ribeirão Preto.</p><h3>Main Features</h3><ul><li>Classification of panoramic radiographs into osteoporosis, osteopenia, or normal</li><li>Ensemble of models to improve prediction accuracy</li><li>Exploratory use of VLMs in medical image analysis</li></ul><h3>Technologies Used</h3><p>The project was developed using:</p><ul><li>Convolutional networks (ConvNeXT, EfficientNet, DeiT, Swin)</li><li>XGBoost for ensemble prediction</li><li>Gemini 2.5 Pro and GPT-4o for experimental LLM classification</li></ul><h3>Results</h3><p>The ensemble model showed the best overall performance across the three classes. ConvNeXT and DeiT also performed well. Swin had intermediate results, while EfficientNet was unbalanced. Language models underperformed compared to visual classifiers.</p></div>",
    "es": "<div><h2>Resumen del Proyecto</h2><p>BoneCheck es un sistema de inteligencia artificial orientado a la detección temprana de la osteoporosis mediante el análisis automático de radiografías panorámicas. A través de redes neuronales y técnicas de clasificación de imágenes, el proyecto ofrece una alternativa accesible y no invasiva al examen de densitometría ósea tradicional. El proyecto fue desarrollado en colaboración con la Facultad de Odontología de la USP Ribeirão Preto.</p><h3>Características Principales</h3><ul><li>Clasificación de radiografías panorámicas en osteoporose, osteopenia o normal</li><li>Uso de ensemble de modelos para mayor precisión</li><li>Uso exploratorio de VLMs en imágenes médicas</li></ul><h3>Tecnologías Utilizadas</h3><p>El proyecto fue desarrollado utilizando:</p><ul><li>Redes convolucionales (ConvNeXT, EfficientNet, DeiT, Swin)</li><li>XGBoost para ensamblado</li><li>Gemini 2.5 Pro y GPT-4o en pruebas con LLMs</li></ul><h3>Resultados</h3><p>El modelo ensemble fue el más eficaz al clasificar las tres categorías. ConvNeXT y DeiT también presentaron buenos resultados. Swin tuvo un rendimiento intermedio y EfficientNet mostró desequilibrio entre clases. Los modelos de lenguaje tuvieron un desempeño inferior.</p></div>"
}