{
  "pt": "<div><h2>Visão Geral do Projeto</h2><p>O Chat Diário Oficial é uma solução end-to-end desenvolvida para otimizar a busca de informações em longas bases de dados textuais, como o Diário Oficial do Município de Belo Horizonte (MG). Utilizando conceitos de Retrieval Augmented Generation (RAG), este projeto visa auxiliar servidores públicos e profissionais que precisam navegar diariamente por extensos documentos, proporcionando uma experiência de busca eficiente e economia de tempo.</p><h3>Principais Características</h3><ul><li>Coleta e processamento dos documentos do Diário Oficial</li><li>Recuperação de informações com base na pergunta do usuário</li><li>Geração de respostas utilizando modelos de linguagem</li><li>Interatividade via chatbot com interface visual</li></ul><h3>Tecnologias Utilizadas</h3><p>O projeto foi desenvolvido utilizando:</p><ul><li>Ferramentas de processamento e armazenamento de textos</li><li>Integração com LLM</li><li>Técnicas de RAG (Retrieval Augmented Generation)</li></ul><h3>Resultados</h3><p>A aplicação foi desenvolvida como uma prova de conceito e ainda requer melhorias para aprimorar sua eficiência e usabilidade. O teste desta ferramenta foi realizado internamente e também com funcionários da Prefeitura de Belo Horizonte, permitindo validar seu funcionamento em um ambiente real.</p></div>",
  "en": "<div><h2>Project Overview</h2><p>The Official Gazette Chat is an end-to-end solution developed to optimize the search for information in extensive textual databases, such as the Official Gazette of Belo Horizonte Municipality (MG). Using Retrieval Augmented Generation (RAG) concepts, this project aims to assist public servants and professionals who need to navigate through extensive documents daily, providing an efficient search experience and saving time.</p><h3>Key Features</h3><ul><li>Collection and processing of Official Gazette documents</li><li>Information retrieval based on user questions</li><li>Response generation using language models</li><li>Interactivity via chatbot with visual interface</li></ul><h3>Technologies Used</h3><p>The project was developed using:</p><ul><li>Text processing and storage tools</li><li>LLM integration</li><li>RAG (Retrieval Augmented Generation) techniques</li></ul><h3>Results</h3><p>The application was developed as a proof of concept and still requires improvements to enhance its efficiency and usability. Testing of this tool was conducted internally and also with employees of the Belo Horizonte City Hall, allowing validation of its operation in a real environment.</p></div>",
  "es": "<div><h2>Visión General del Proyecto</h2><p>El Chat del Diario Oficial es una solución integral desarrollada para optimizar la búsqueda de información en extensas bases de datos textuales, como el Diario Oficial del Municipio de Belo Horizonte (MG). Utilizando conceptos de Generación Aumentada por Recuperación (RAG), este proyecto busca ayudar a funcionarios públicos y profesionales que necesitan navegar diariamente por documentos extensos, proporcionando una experiencia de búsqueda eficiente y ahorro de tiempo.</p><h3>Características Principales</h3><ul><li>Recolección y procesamiento de documentos del Diario Oficial</li><li>Recuperación de información basada en las preguntas del usuario</li><li>Generación de respuestas utilizando modelos de lenguaje</li><li>Interactividad a través de chatbot con interfaz visual</li></ul><h3>Tecnologías Utilizadas</h3><p>El proyecto fue desarrollado utilizando:</p><ul><li>Herramientas de procesamiento y almacenamiento de textos</li><li>Integración con LLM</li><li>Técnicas de RAG (Generación Aumentada por Recuperación)</li></ul><h3>Resultados</h3><p>La aplicación fue desarrollada como una prueba de concepto y aún requiere mejoras para optimizar su eficiencia y usabilidad. La prueba de esta herramienta se realizó internamente y también con empleados de la Alcaldía de Belo Horizonte, permitiendo validar su funcionamiento en un entorno real.</p></div>"
}
