{
  "pt": "<div><h2>Visão Geral do Projeto</h2><p>O SpellNet é uma aplicação de visão computacional voltada para o reconhecimento e validação de fingerspelling em tempo real nas línguas de sinais Libras e ASL. A aplicação permite que usuários realizem gestos de letras com as mãos e recebam feedback automático de um modelo treinado para esse reconhecimento. O projeto é fruto da parceria entre o grupo RAIA e a edtech SignLink.</p><h3>Principais Características</h3><ul><li>Reconhecimento em tempo real de fingerspelling em Libras e ASL</li><li>Interface interativa com validação gráfica dos gestos</li><li>Criação e uso de datasets especializados para sinais manuais</li></ul><h3>Tecnologias Utilizadas</h3><p>O projeto foi desenvolvido utilizando:</p><ul><li>Redes neurais convolucionais (CNN)</li><li>Pré-processamento de imagens</li><li>Streamlit e FastAPI</li></ul><h3>Resultados</h3><p>O modelo final apresentou acurácia de 90% para Libras e 79% para ASL. Foram construídos dois datasets especializados com 3700 e 5000 imagens por classe, respectivamente. A aplicação final permite o reconhecimento em tempo real e validação visual dos sinais feitos pelos usuários.</p></div>",
  "en": "<div><h2>Project Overview</h2><p>SpellNet is a computer vision application for real-time recognition and validation of fingerspelling in both Brazilian Sign Language (Libras) and American Sign Language (ASL). Users can perform hand gestures representing letters and receive instant feedback from a deep learning model trained for this purpose. The project is a collaboration between the RAIA group and the edtech SignLink.</p><h3>Main Features</h3><ul><li>Real-time recognition of fingerspelling in Libras and ASL</li><li>Interactive interface with gesture validation</li><li>Custom dataset creation for sign language alphabets</li></ul><h3>Technologies Used</h3><p>The project was developed using:</p><ul><li>Convolutional Neural Networks (CNN)</li><li>Image preprocessing techniques</li><li>Streamlit and FastAPI</li></ul><h3>Results</h3><p>The model achieved 90% accuracy for Libras and 79% for ASL. Two dedicated datasets were created, with 3700 and 5000 images per class, respectively. The resulting application enables real-time recognition and visual validation of user-performed signs.</p></div>",
  "es": "<div><h2>Resumen del Proyecto</h2><p>SpellNet es una aplicación de visión por computadora para el reconocimiento y validación en tiempo real de fingerspelling en Libras y ASL. Los usuarios pueden realizar gestos con las manos representando letras y recibir retroalimentación instantánea de un modelo entrenado específicamente para este fin. El proyecto es una colaboración entre el grupo RAIA y la edtech SignLink.</p><h3>Características Principales</h3><ul><li>Reconocimiento en tiempo real de fingerspelling en Libras y ASL</li><li>Interfaz interactiva con validación visual de gestos</li><li>Creación de datasets personalizados para alfabetos en lengua de señas</li></ul><h3>Tecnologías Utilizadas</h3><p>El proyecto fue desarrollado utilizando:</p><ul><li>Redes neuronales convolucionales (CNN)</li><li>Técnicas de preprocesamiento de imágenes</li><li>Streamlit y FastAPI</li></ul><h3>Resultados</h3><p>El modelo final logró una precisión del 90% para Libras y 79% para ASL. Se construyeron dos conjuntos de datos personalizados con 3700 y 5000 imágenes por clase. La aplicación permite reconocimiento en tiempo real y validación visual de los gestos realizados por los usuarios.</p></div>"
}
