{
  "pt": "<div><h2>Visão Geral do Projeto</h2><p>Atualmente, modelos de inteligência artificial permitem clonagem de voz de qualquer pessoa utilizando um áudio curto de referência. Entretanto, algumas características podem não ser tão bem reproduzidas, como sotaques, pronúncia de vocabulário específico, timbre, efeitos da voz, etc.</p><p>Para contornar esse problema, pode-se fazer finetuning desses modelos, permitindo que o modelo aprenda com mais exemplos. Entretanto, esse processo é muito trabalhoso e envolve várias subtarerfas. Pensando nisso, este projeto propõe-se a simplificar esse cenário ao desenvolver uma automação de fine-tuning para modelos de text-to-speech.</p><h3>Principais Características</h3><ul><li>Gerador de datasets a partir de áudio brutos em língua portuguesa</li><li>Normalizador de textos em língua portuguesa</li><li>Avaliação dos resultados dos modelos por meio de métricas de qualidade e naturalidade da fala</li><li>Exemplo de fine-tuning com o modelo XTTS-v2 em língua portuguesa</li><li>Exemplo de fine-tuning com o modelo Orpheus-TTS em língua inglesa</li><li>Interface interativa para manipulação dos componentes do projeto</li></ul><h3>Tecnologias Utilizadas</h3><p>O projeto foi desenvolvido utilizando:</p><ul><li>Modelos text-to-speech (XTTS-v2 e Orpheus)</li><li>Técnicas de processamento de áudio utilizando Python</li><li>Métricas de avaliação de síntese de áudio (SECS, UMOR e CER)</li></ul><h3>Resultados</h3><p>Como resultado, foi produzida uma aplicação com framework automático de finetuning de modelos text-to-speech a partir de áudios em português. Também, foi criada a biblioteca TTS-Utils com módulos reutilizáveis para outros contextos text-to-speech.</p></div>",
  "en": "<div><h2>Project Overview</h2><p>Currently, artificial intelligence models allow for voice cloning of any person using a short reference audio. However, some characteristics may not be well reproduced, such as accents, specific vocabulary pronunciation, timbre, voice effects, etc.</p><p>To address this issue, fine-tuning can be performed on these models, allowing them to learn from more examples. However, this process is very labor-intensive and involves several subtasks. With that in mind, this project aims to simplify the process by developing an automation framework for fine-tuning text-to-speech models.</p><h3>Main Features</h3><ul><li>Dataset generator from raw Portuguese audio</li><li>Text normalizer for the Portuguese language</li><li>Evaluation of model outputs using speech quality and naturalness metrics</li><li>Fine-tuning example with the XTTS-v2 model in Portuguese</li><li>Fine-tuning example with the Orpheus-TTS model in English</li><li>Interactive interface for managing the project components</li></ul><h3>Technologies Used</h3><p>The project was developed using:</p><ul><li>Text-to-speech models (XTTS-v2 and Orpheus)</li><li>Audio processing techniques using Python</li><li>Audio synthesis evaluation metrics (SECS, UMOR and CER)</li></ul><h3>Results</h3><p>As a result, an application with an automatic fine-tuning framework for text-to-speech models from Portuguese audio was produced. Also, the TTS-Utils library was created with reusable modules for other text-to-speech contexts.</p></div>",
  "es": "<div><h2>Resumen del Proyecto</h2><p>Actualmente, los modelos de inteligencia artificial permiten la clonación de voz de cualquier persona utilizando un audio corto de referencia. Sin embargo, algunas características pueden no reproducirse tan bien, como acentos, pronunciación de vocabulario específico, timbre, efectos de voz, etc.</p><p>Para abordar este problema, se puede realizar ajuste fino en estos modelos, permitiendo que aprendan con más ejemplos. Sin embargo, este proceso es muy laborioso e involucra varias subtareas. Pensando en eso, este proyecto se propone simplificar este escenario desarrollando una automatización del ajuste fino para modelos de texto a voz.</p><h3>Características Principales</h3><ul><li>Generador de conjuntos de datos a partir de audio bruto en portugués</li><li>Normalizador de textos en lengua portuguesa</li><li>Evaluación de resultados de modelos mediante métricas de calidad y naturalidad del habla</li><li>Ejemplo de ajuste fino con el modelo XTTS-v2 en portugués</li><li>Ejemplo de ajuste fino con el modelo Orpheus-TTS en inglés</li><li>Interfaz interactiva para la manipulación de los componentes del proyecto</li></ul><h3>Tecnologías Utilizadas</h3><p>El proyecto fue desarrollado utilizando:</p><ul><li>Modelos de texto a voz (XTTS-v2 y Orpheus)</li><li>Técnicas de procesamiento de audio usando Python</li><li>Métricas de evaluación de síntesis de audio (SECS, UMOR y CER)</li></ul><h3>Resultados</h3><p>Como resultado, se produjo una aplicación con un marco automático de ajuste fino para modelos de texto a voz a partir de audio en portugués. También se creó la biblioteca TTS-Utils con módulos reutilizables para otros contextos de texto a voz.</p></div>"
}
