{
  "pt": "<div><h2>Visão Geral do Projeto</h2><p>O VestAgents é uma ferramenta de geração de questões inéditas para vestibulares brasileiros, baseada em Large Language Models (LLMs). Utiliza abordagens como Recuperação Aumentada por Geração (RAG), few-shot prompting e web scraping para contextualizar e personalizar a criação das questões. O projeto é desenvolvido com apoio da edtech PICO.</p><h3>Principais Características</h3><ul><li>Geração automática de questões de vestibulares brasileiros</li><li>Contextualização baseada em textos da web</li><li>Consulta a banco especializado de questões passadas</li><li>Orquestração multi-agente com fluxos distintos</li></ul><h3>Tecnologias Utilizadas</h3><p>O projeto foi desenvolvido utilizando:</p><ul><li>Crew.ai</li><li>Serper (para scraping)</li><li>GPT-4o como juiz avaliador</li></ul><h3>Resultados</h3><p>O sistema demonstrou desempenho superior à geração direta via LLM (GPT-4o-mini), com 62% de preferência frente a 26% para LLM puro, segundo avaliação por LLM as a judge com critérios como clareza, contextualização e qualidade dos distratores.</p></div>",
  "en": "<div><h2>Project Overview</h2><p>VestAgents is a novel question-generation tool for Brazilian university entrance exams (vestibulares), based on Large Language Models (LLMs). It combines Retrieval-Augmented Generation (RAG), few-shot prompting, and web scraping to generate customized, contextualized questions. The project is supported by edtech PICO.</p><h3>Main Features</h3><ul><li>Automatic generation of university entrance exam questions</li><li>Context retrieval using web support texts</li><li>Querying a specialized past exam question bank</li><li>Multi-agent orchestration with modular task flows</li></ul><h3>Technologies Used</h3><p>The project was developed using:</p><ul><li>Crew.ai</li><li>Serper (for scraping)</li><li>GPT-4o as LLM-as-a-judge</li></ul><h3>Results</h3><p>The agent-based system achieved superior performance over GPT-4o-mini alone, with 62% preference vs. 26%, based on clarity, context, and distractor quality as evaluated by another LLM.</p></div>",
  "es": "<div><h2>Resumen del Proyecto</h2><p>VestAgents es una herramienta innovadora para la generación de preguntas inéditas para exámenes vestibulares brasileños, basada en Modelos de Lenguaje a Gran Escala (LLMs). Utiliza estrategias como Generación Aumentada por Recuperación (RAG), few-shot prompting y scraping web para crear preguntas contextualizadas. El proyecto cuenta con el apoyo de la empresa de tecnología educativa PICO.</p><h3>Características Principales</h3><ul><li>Generación automática de preguntas de exámenes vestibulares</li><li>Contextualización mediante textos de apoyo de la web</li><li>Consulta a un banco de preguntas especializadas de años anteriores</li><li>Orquestación de múltiples agentes con flujos personalizados</li></ul><h3>Tecnologías Utilizadas</h3><p>El proyecto fue desarrollado utilizando:</p><ul><li>Crew.ai</li><li>Serper (para scraping)</li><li>GPT-4o como juez evaluador</li></ul><h3>Resultados</h3><p>El sistema de agentes superó en rendimiento a la generación directa con GPT-4o-mini, con una preferencia del 62% frente al 26%, según evaluación de claridad, contexto y calidad de distractores realizada por otro LLM.</p></div>"
}
